#include <stdio.h>

int main() {
    unsigned int a = 60; //60 = 0011 1100
    unsigned int b = 13; //13 = 0000 1101
    unsigned int c;


    c = a & b; // 按位与，0011 1100 & 0000 1101 = 0000 1100 = 12
    printf("a & b = %u\n", c);

    c = a | b; // 按位或，0011 1100 | 0000 1101 = 0011 1101 = 61
    printf("a | b = %u\n", c);

    c = a ^ b; // 按位异或，0011 1100 ^ 0000 1101 = 0011 0001 = 49
    printf("a ^ b = %u\n", c);

    c = ~a; // 按位取反，~0011 1100 = 1100 0011 = -61
    printf("~a = %u\n", c);//按位取反后，结果是无符号整数，使用%u输出的是4294967235而不是-61

    c = ~a;
    printf("~a = %d\n", c);//按位取反后，结果是无符号整数，使用%d输出的是-61

    c = a << 2; // 左移两位，0011 1100 << 2 = 1111 0000 = 240
    printf("a << 2 = %u\n", c); 

    c = a >> 2; // 右移两位，0011 1100 >> 2 = 0000 1111 = 15
    printf("a >> 2 = %u\n", c);

    return 0;
}
